{
  "aboutMe": "About Me",
  "greeting": "Hey, my name is Oskar and I am a student at the University of Economics in Katowice. I am currently studying a major in computer science with a specialisation in programming and algorithms, and in the future I plan to focus mainly on the topics of machine learning, neural networks and image processing. In my free time, I develop hobbies such as board games, theatre or art, and I also like to deepen my knowledge in topics that particularly interest me, such as the aforementioned machine learning. I'm also very passionate about tea, especially Eastern tea and the traditional way of brewing it. I also enjoy reading, especially Sci-Fi and Fantasy, and when I have a free moment I like to play computer games, especially Baldur's Gate. In addition to this I work behind the bar at weekends which has allowed me to develop my soft skills and gain practical experience.",
  "greeting2": "If you would like to find out more about me, I invite you to explore this site and especially to take a look at the projects I have done so far, as well as my CV. In addition to this, on my site you can create an account which will enable you to sign up for tutoring with me, where I can share my knowledge with you and help you develop in areas such as mathematics or programming",
  "objectProgramming": "Object Programming",
  "abstraction": "Abstraction",
  "encapsulation": "Encapsulation",
  "inheritance": "Inheritance",
  "polymorphism": "Polymorphism",
  "websiteDesign": "Website Design",
  "machineLearning": "Machine Learning",
  "classification": "Classification",
  "regression": "Regression",
  "neuralNetworks": "Neural Networks",
  "imageProcessing": "Image processing",
  "extraSkills": "Extra Skills",
  "agileProgramming": "Agile Programming",
  "algorithms": "Algorithms",
  "sortAlgorithms": "Sort Algorithms",
  "dataStructures": "Data Structures",
  "greedyProgramming": "Greedy Programming",
  "divideAndConquer": "Divide and Conquer",
  "geneticAlgorithms": "Genetic Algorithms",
  "login": "You are logged in!",
  "readMore": "Read More",
  "readLess": "Read Less"
}
