{
  "nasaTitle": "Strona Nasa",
  "nasa": "Projekt \"Nasa\" był przedsięwzięciem mającym na celu rozwinięcie naszych umiejętności pracy zespołowej i programowania zgodnie z metodyką Agile. W ramach tego projektu stworzyliśmy stronę internetową o tematyce kosmicznej, która intensywnie korzysta z możliwości oferowanych przez API NASA, ale nie tylko. Stworzyliśmy cztery główne funkcje: wyświetlanie obrazów APOD, mapę na żywo pokazującą katastrofy widoczne z kosmosu, skalę porównawczą asteroid przelatujących blisko Ziemi oraz możliwość zobaczenia mapy gwiazd wybranej konstelacji. Ponadto, umożliwiliśmy logowanie i rejestrację użytkowników, aby mogli tworzyć własne konta i dodawać interesujące ich zdjęcia do galerii, a także kilka mniejszych opcji, takich jak wykresy z danymi z kosmosu, strony poświęcone poszczególnym planetom i mapa pokazująca położenie innych planet w stosunku do Ziemi. Do tworzenia strony użyliśmy głównie języka Python i jego szerokiego zakresu bibliotek, takich jak Sunpy, Folium i Astropy, a także frameworka Flask oraz CSS i HTML. W tym projekcie byłem odpowiedzialny m.in. za zarządzanie pracą, implementację 3 z 4 głównych funkcji, kilka mniejszych oraz pomoc przy front-endzie.",
  "button": "Idź do",
  "chessTitle": "Szachy",
  "chess": "Projekt „Chess” był moim projektem końcowym w języku Java. Zdecydowałem się stworzyć podstawową strukturę do gry w szachy, wykorzystując obiektowy charakter języka Java. Stworzyłem oddzielne klasy dla każdej z figur szachowych, które dziedziczą z klasy figura, a także klasy takie jak szachownica, ruch i gra, aby efektywnie zarządzać stanem gry oraz możliwościami ruchu. Użyłem zarówno reprezentacji szachownicy, jak i figur, aby szachownica rejestrowała figury w danym momencie, ale także, aby każda figura znała swoje aktualne położenie, co ułatwia weryfikację legalności ruchu. Mój zestaw szachowy implementuje również wszystkie bardziej skomplikowane ruchy szachowe, takie jak roszada czy bicie w przelocie, a także oczywiście szach, pat i mat. Po zakończeniu projektu postanowiłem rozwijać go samodzielnie, tworząc interfejs gry i implementując prosty silnik szachowy, który umożliwia grę przeciwko botowi. Projekt nauczył mnie bardziej obiektowego myślenia, zwłaszcza w większych projektach, gdzie jest wiele klas i trzeba mądrze planować interakcję między nimi, a także pokazał mi, jak interesujące może być programowanie szachów i zachęcił mnie do kontynuowania tego projektu.",
  "predictionTitle": "Predykcja cen komputerów na podstawie części",
  "testingTitle": "Testowanie i Optymalizacja"
}